#include<bits/stdc++.h>//懒人专用 
using namespace std;
int a,b,ans;//a,b=从a->b中的年份,ans=计数器(有几个回文年数) 
int x,y;//从x年至y年 
int t[1000000],q[25]={31,29,31,30,31,30,31,31,30,31,30,31};//一年的月份 
int hw(int u)//对数字u进行反序处理 
{
	int k=0;
	while(u!=0)
	{
		k=k*10+u%10;//每次加新数时,k往前挪一个位置 
		u/=10;
	}
	return k;
}
int main()
{
	//20191101
	int i,j,k1,k2,k;
	cin>>a>>b;
	x=a%100000/10000+a%1000000/100000*10+a%10000000/1000000*100+a%100000000/10000000*1000;//算出是几几年 
	y=b%100000/10000+b%1000000/100000*10+b%10000000/1000000*100+b%100000000/10000000*1000;//同理 
	//对x->y年进行枚举 
	for(i=x;i<=y;i++)//年 
		for(k1=1;k1<=12;k1++)//月 
			for(k2=1;k2<=q[k1-1];k2++)//日 
			{
//				cout<<i<<" "<<k1<<" "<<k2<<endl;
				k=i*10000+k1*100+k2;//构成这天用8位数表达方式 
				if(k==hw(k))//判断是否回文 
					ans++; 
			}
	cout<<ans;//输出 
	return 0;//好习惯 
}
//新手专用代码(大佬勿喷) 
